/*
Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0.
*/
#include <stdio.h>
int main()
{
    int m,n,i,j,a[100][100],o,p;
    int s1,s2,s3,s4;
    s1=s2=s3=s4=0;
    scanf("%d%d",&m,&n);
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&a[i][j]);
        }
    }
    scanf("%d%d",&o,&p);
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            if(i<o&&j<p)
            s2+=a[i][j];
            else if(i<o&&j>=p)
            s1+=a[i][j];
            else if(i>=o&&j>=p)
            s4+=a[i][j];
            else
            s3+=a[i][j];
        }
    }
    printf("%d %d %d %d",s1,s2,s3,s4);
}