/*
Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:

индекс (шестцифрен цел број)
шест оценки од последниот семестар кој го слушал
Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: (погледнете во тест примерите за форматот на печатење)

просек на студентот
просекот да се испечати со точност од 3 децимали
година на студии
студентите чијшто индекс почнува на 17 се трета година, на 16 се четврта година, на 15 се петта година итн.
дали е награден (1 = награден, 0 = не е награден)
Еден студент се наградува доколку има просек еднаков или поголем од 9.5
*/
#include <stdio.h>

int main()
{
    int indeks,a,b,c,d,e,f,nag,i,n=0;
    scanf("%d%d%d%d%d%d%d",&indeks,&a,&b,&c,&d,&e,&f);
    float prosek = (a+b+c+d+e+f)/6.0;
    printf("Prosek: %.3f\n",prosek);
    printf("Student: %d\n",indeks);
    int godina=indeks/10000;
    for(i=19;i>=godina;i--)
    {
        n++;
    }
    printf("%d godina\n",n);
    if(prosek>=9.5)
    {
        nag=1;
    }
    else
    {
        nag=0;
    }
    printf("Nagraden: %d\n",nag);
}
