/*
Да се напише програма каде од тастатура ќе се внесе еден број кој има пет цифри, но не мора да е петцифрен, како на пример 04569 или 00256. Програмата ги печати сумите на паровите цифри од надвор кон внатре, за на крај да ја испечати средишната цифра. Така, ако внесениот број е 12596, програмата враќа 7 11 5.

влез: 12596 
излез: 7 11 5
*/
#include <stdio.h>

int main()
{
    int n,a,b,c,d,e;
    scanf("%d",&n);
    a=n/10000;
    b=n/1000%10;
    c=n/100%10;
    d=n%100/10;
    e=n%10;
    printf("%d ",a+e);
    printf("%d ",b+d);
    printf("%d ",c);    
}
