// Благ број е број што е составен само од парни цифри (0, 2, 4, 6, 8). Во зададен опсег (почетокот m и крајот на опегот n се цели броеви чија вредност се внесува од тастатура), да се најде и испечати најмалиот „благ број“. Ако не постои таков број, да се испечати NE.
#include <stdio.h>
int main()
{
    int a,b,temp,i,cifra,m=0,n=0,p=0;
    scanf("%d%d",&a,&b);
    for(i=a;i<=b;i++)
    {   
        for(temp=i;temp!=0;temp/=10)
        {
            m++;
            if((temp%10)%2==0)
            {
                n++;
            }
        }
        if(m==n)
        {printf("%d",i);
        p++;
        break;}
        m=0;
        n=0;
    }
    if(p==0)
    {printf("NE");}
    }
        