/*
Од тастатура се читаат 2 позитивни цели броеви. Доколку се внесе барем еден негативен број или 0 треба да се печати „Invalid input“.

Треба да се определи дали помалиот број “е парен еквивалент” од поголемиот број.

Еден број “е парен еквивалент” на друг број, ако и само ако неговите цифри се наоѓаат на парните позиции од другиот број, во истиот редослед. Соодветно да се испечатат пораки „PAREN“ и „NE“.

Позициите треба да се сметаат оддесно-налево (најмалку значајната цифра е на позиција 1)
*/
#include <stdio.h>
#define MAX 100
int main()
{
    int a,b,i,br1=1,br2=1,j=0,temp;
    int niza1[MAX],niza2[MAX];
    scanf("%d %d",&a,&b);
    if(a<=0 || b<=0)
    { printf("Invalid input");}
    else
    {
        if(a<b)
        {
            temp=a;
            a=b;
            b=temp;
        }
        for(i=a;i!=0;i/=10)
        {
            niza1[br1]=i%10;
            br1++;
        }
        for(i=b;i!=0;i/=10)
        {
            niza2[br2]=i%10;
            br2++;
        }
        for(i=1;i<br2;i++)
        {
            if(niza2[i]==niza1[2*i])
            {
                j++;
            }
            }
    if(j==br2-1)
    {
        printf("PAREN");
    }
    else
    {
        printf("NE");
    }
    }

}