/*
Од стандарден влез се внесуваат два цели броја N и Х.

Да се најде најблискот број помал од N коj е тотално различен од бројот Х.

Еден број е тотално различен од друг ако и само ако во него не се појавува ниту една од цифрите на другиот број.

Задачата да се реши без употреба на низи и матрици.
*/
#include <stdio.h>
int main()
{
    int n,x,i,j,temp,k=0;
    scanf("%d%d",&n,&x);
    i=n-1;
    while(i)
    {
        for(temp=i;temp!=0;temp/=10)
        {
            for(j=x;j!=0;j/=10)
            {
                if(j%10==temp%10)
                {
                    k++;
                    break;
                }
            }
        }
        if(k==0)
        {
            break;
        }
        k=0;
    i--;
    }
    printf("%d",i);

}