/*
Да се напише програма во која се вчитува матрица (со димензии M и N, 1 < M,N <= 100) од цели броеви.

Сите елементи од матрицата се поставени на вредност 0 или 1.

Да се формира нова матрица така што на местото на сите елементи што имаат вредност 0, треба да се смести бројот на елементи со вредност 1 околу тој елемент во сите осум насоки.

Новодобиената матрица да се отпечати на стандарден излез, при што наместо елементите со вредност 1 од оригиналната матрица ќе се отпечати знак *.

Пример влез:

4 5
1 0 0 1 0
0 0 1 1 1
0 1 0 0 1
1 1 0 1 0
излез:

* 2 3 * 3
2 3 * * *
3 * 5 5 *
* * 3 * 2
*/
#include <stdio.h>
int main()
#define MAX 100
{
    int i,j,m,n,br=0;;
    int matrica[MAX][MAX]={0,};
    int matrica1[MAX][MAX];
    scanf("%d %d",&m,&n);
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&matrica[i][j]);
        }
    }
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            if(matrica[i][j]==0)
            {
                if(matrica[i+1][j]==1)
                {br++;}
                if(matrica[i][j+1]==1)
                {br++;}
                if(matrica[i-1][j]==1)
                {br++;}
                if(matrica[i][j-1]==1)
                {br++;}
                if(matrica[i+1][j+1]==1)
                {br++;}
                if(matrica[i-1][j-1]==1)
                {br++;}
                if(matrica[i+1][j-1]==1)
                {br++;}
                if(matrica[i-1][j+1]==1)
                {br++;}
                matrica1[i][j]=br;
            }
            if(matrica[i][j]==1)
            {matrica1[i][j]='*';}
            br=0;
        }
    }
    for(i=0;i<m;i++)
    {
        for(j=0;j<n;j++)
        {
            if(matrica1[i][j]==42)
            {printf("* ");}
            else
            printf("%d ",matrica1[i][j]);
        }
        printf("\n");
        
    }
}