/*
Од стандарден влез се чита позитивен непарен број n (n е најмалку 3) кој ги дава димензиите на квадратната матрица од цели броеви, која се чита во продолжение. Да се напише програма која од таа матрица(макс. 100 x 100) ќе креира нова матрица 2 x 2, која ќе ги има за елементи збировите на елементите на регионите на првата матрица, соодветно. Во продолжение на сликата може да видиме како се добиваат регионите за матрица кога n = 5.



За оваа матрица, резултантната матрица би била:

https://heckgaming.com/HBUuTx.png

17 28
16 28
*/
#include <stdio.h>
#define MAX 100
int main()
{
    int n,i,j,sum1=0,sum2=0,sum3=0,sum4=0;
    scanf("%d",&n);
    int matrica[MAX][MAX];
    int mat1[2][2]={0};
    for(i=0;i<n;i++)
    {
        for(j=0;j<n;j++)
        {
            scanf("%d",&matrica[i][j]);
        }
    }
    for(i=0;i<n;i++)
    {
        for(j=0;j<n;j++)
        {
            if(i<n/2&&j<n/2)
            {
            mat1[0][0]+=matrica[i][j];
            }
            if(i<n/2&&j>n/2)
            {
            mat1[0][1]+=matrica[i][j];
            }
            if(i>n/2&&j<n/2)
            {
            mat1[1][0]+=matrica[i][j];
            }
            if(i>n/2&&j>n/2)
            {
            mat1[1][1]+=matrica[i][j];
            }
        }
    }
     for(i=0;i<2;i++)
    {
        for(j=0;j<2;j++)
        {
            printf("%d ",mat1[i][j]);
        }
        printf("\n");
    }
}