//Да се напише програма која за даден број К ќе дешифрира која буква во латинската азбука се појавува после К букви од почетната буква C. К може да биде поголемо од бројот на букви во азбуката, при што броењето ќе продолжи од почеток (циклично). Се земаат во предвид само големи букви. На влез се читаат C и К, а на излез се печати дешифрираната буква. Задачата да се реши користејќи низа за големите букви од латинската азбука и при дешифрирање да се користат стандардните операции за низи.

#include <stdio.h>

int main()
{
    int i,j,k;
    char n[26],c;
    for(i=0;i<26;i++)
    {
        n[i]=i+65;
    }
    scanf("%c %d", &c, &k);
    j=k%26;
    for(i=0;i<26;i++)
    {
        if(c-65==i)
        {
            n[i]+=j;
            if(n[i]>90)
            {
                printf("%c",n[i]-26);
            }
            else
            {
                printf("%c",n[i]);
            }
        }
    }
}
