/*
Од стандарден влез се чита цел број n. Потоа се вчитуваат n низи од цели броеви (со максимална должина од 100 елементи), при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата, па на крај бројот k.

Да се напише програма која за секоја низа ќе ја трансформира истата, т.ш. за секој k-ти елемент ќе се направи замена на местата помеѓу него и неговиот претходник. Се смета дека важи k е најмалку 2.

На пример, ако е дадена следната низа:

1 2 3 4 5 6 7 8, за k=2 се добива

2 1 4 3 6 5 8 7
Да се испечатат сите трансформирани низи.
*/
#include <stdio.h>

int main()
{
    int n,m,i,j,k,tmp;
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
        scanf("%d",&m);
        int a[m];
        for(j=0;j<m;j++)
        {
            scanf("%d",&a[j]);
        }
        scanf("%d",&k);
        for(j=k;j<=m;j+=k)
        {
            tmp=a[j-1];
            a[j-1]=a[j-2];
            a[j-2]=tmp;
        }
        for(j=0;j<m;j++)
        {
            printf("%d ",a[j]);
        }
        printf("\n");
    }
}