/*
Од стандарден влез се чита цел број N. Потоа се вчитуваат N низи од цели броеви (со максимална должина од 100 елементи), при што за секоја прво се внесува должината на низата, а потоа сите елементи на низата.

Да се напише програма која за секоја низа ќе го испечати процентот на огледални еднакви броеви во низата. Огледални броеви во низа се првиот и последниот, вториот и претпоследниот итн. Доколку низата има непарен број на елементи, средниот елемент е и огледален и еднаков.

пример влез:

3
5 7 2 5 2 8
6 1 2 3 3 1 1
8 8 4 8 3 2 1 4 8
пример излез и објаснување:

60.00% (2,2,5 се огледални и еднакви -> 3/5 елементи -> 60%)
66.67% (1,1,3,3 се огледални и еднакви -> 4/6 елементи -> 66.67%)
50.00% (8,8,4,4 се огледални и еднакви -> 4/8 елементи -> 50.00%)
*/
#include <stdio.h>

int main()
{
    int n,m,i,j,br=0;
    float proc;
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
        scanf("%d",&m);
        int a[m];
        for(j=0;j<m;j++)
        {
            scanf("%d",&a[j]);
        }
        for(j=0;j<m/2;j++)
        {
            if(a[j]==a[m-1-j])
            {
            br+=2;
            }
        }
        if(m%2==1)
        {
            br++;
        }
        proc=(float)br/m*100;
        printf("%.2f%%\n",proc);
        proc=0;
        br=0;
    }
    return 0;
}