/*
За дадена низа со големина N, прочитајте ги сите елементи од дадениот влез, а потоа сортирајте ја низата. Испечатете ја во растечки редослед.

Пример:

Влез:

5

4 3 2 5 1

Излез:

1 2 3 4 5
*/
#include <stdio.h>

int main()
{
    int n,i,k,tmp;
    scanf("%d",&n);
    int a[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    for(i=0;i<n;i++)
    {
        for(k=i+1;k<n;k++)
        {
            if(a[i]>a[k])
            {
            tmp=a[i];
            a[i]=a[k];
            a[k]=tmp;
            }
        }
    }
    for(i=0;i<n;i++)
    {
        printf("%d ",a[i]);
    }
    
}