/*
Од тастатура се внесува низа од целобројни елементи А со должина N ( N <= 100). Дополнително се внесува и број К. Да се трансформира низата така што на почеток ќе се преместат сите елементи помали од K, а после нив ќе следуваат броевите поголеми или еднакви на K. Редоследот на елементите да не се менува.

Испечатете ги елементите на трансформираната низа во еден ред на стандарден излез разделени со празно место.

Пример:
A[] = {1, 3, 2, 5, 9, 0, 8, 10}, K=6
Трансформираната низа ќе биде:
A[] = {1, 3, 2, 5, 0, 9, 8, 10}

A[] = {10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 0}, K=6
Трансформираната низа ќе биде:
A[] = {5, 4, 3, 2, 1, 0, 10, 9, 8, 7, 6}

A[]={2, 4, 6, 8, 10}, K = 5
Трансформираната низа ќе биде:
A[] = {2, 4, 6, 8, 10}

A[]={1, 3, 5, 7, 9} K = 5
Трансформираната низа ќе биде:
A[] = {1, 3, 5, 7, 9}
*/
#include <stdio.h>

int main()
{
    int n,i,k,br=0,j=0,p=0;
    scanf("%d",&n);
    int a[n],tmp1[n],tmp2[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    scanf("%d",&k);
    for(i=0;i<n;i++)
    {
        if(k>a[i])
        {
        tmp1[j]=a[i];
        j++;
        br++;
        }
        else
        {
        tmp2[p]=a[i];
        p++;
        }
    }
    j=0;
    p=0;
    for(i=0;i<n;i++)
    {
        if(br!=0)
        {
            a[i]=tmp1[j];
            br--;
            j++;
        }
        else
        {
            a[i]=tmp2[p];
            p++;
        }
    }
    for(i=0;i<n;i++)
    {
        printf("%d ",a[i]);
    }
    return 0;
}
