/*
Од стандарден влез се чита цел број К, по што се читаат N цели броеви. Да се напише програма која за секој прочитан број на стандарден излез ќе ги отпечати неговите цифри кои се поголеми од К, како и збирот на цифрите кои се отпечатени. Печатењето на цифрите поголеми од K да се реализира со посебна рекурзивна функција.

Пример: Доколку К = 5, за бројот 8423871 треба да се отпечати 887 : 23
*/
#include <stdio.h>
int funkcija(int x,int k)
{
    if(x<10)
    {
        if(x%10>k)
        {
            printf("%d",x%10);
            return x;
        }
    }
    else
    {
    int sum=funkcija(x/10,k);
    if(x%10>k)
    {
        printf("%d",x%10);
        sum+=x%10;
    }
    return sum;
    }
}
int main()
{
    int k,n,x,i;
    scanf("%d",&k);
    scanf("%d",&n);
    for(i=0;i<n;i++)
    {
        scanf("%d",&x);
        printf(" : %d\n",funkcija(x,k));
    }
}
