/*
Од тастатура се чита еден непарен цел број n кој е поголем или еднаков на 5. Со помош на знакот * да се исцрта математичкиот симбол за бесконечност, кој би се добил како во примерот подолу, за n=5:

*   *
** **
* * *
** **
*   *
*/
#include <stdio.h>

int main()
{
    int n;
    int i;
    int j;
    scanf("%d",&n);
    for(i=1;i<=n;i++)
    {
        printf("*");
        for(j=1;j<=n-2;j++)
        {
            if(j==i-1||j==n-i)
            {
                printf("*");
            }
            else
            {
                printf(" ");
            }
        }
        printf("*\n");
    }
    return 0;
}