/*
Од тастатура се чита еден непарен цел број n кој е поголем или еднаков на 5. Со помош на знакот * да се исцрта песочен часовник, кој има основи со должина n, како што е во примерот подолу, за n=5:

*****
 * * 
  *
 * *
*****
*/
#include <stdio.h>
#include <stdlib.h>

int main()
{
    int n,i,j;
    scanf("%d",&n);
    for(i=1;i<=n;i++)
    {
        for(j=1;j<=n;j++)
        {
            if(i==1||i==n)
            {
                printf("*");
            }
             else if(j==i||j==n-i+1)
            {
                printf("*");
            }
            else
            {
                printf(" ");
            }
        }
        printf("\n");


    }
}
